DavidMarquezF/mf-embedded/apps/attiny85/semaphore/usi_twi_slave.c
  // The 'in_transaction' variable remembers if the usiTwiSlave driver is in the middle of
  // an i2c transaction. Initialize it to zero
  in_transaction = 0;

} // end usiTwiSlaveInit


bool usi_twi_data_in_transmit_buffer(void)
{

  // return 0 (false) if the receive buffer is empty
  return txCount;

} // end usiTwiDataInTransmitBuffer


// put data in the transmission buffer, wait if buffer is full

void usi_twi_transmit_byte( uint8_t data )
{

  // wait for free space in buffer
  while ( txCount == TWI_TX_BUFFER_SIZE) ;

  // store data in buffer
  txBuf[ txHead ] = data;
  txHead = ( txHead + 1 ) & TWI_TX_BUFFER_MASK;
  txCount++;

} // end usiTwiTransmitByte


// return a byte from the receive buffer, wait if buffer is empty

uint8_t usi_twi_receive_byte( void )
{
  uint8_t rtn_byte;

  // wait for Rx data
  while ( !rxCount );

  rtn_byte = rxBuf [ rxTail ];
  // calculate buffer index
  rxTail = ( rxTail + 1 ) & TWI_RX_BUFFER_MASK;
  rxCount--;

  // return data from the buffer.
  return rtn_byte;

} // end usiTwiReceiveByte


uint8_t usi_twi_amount_data_in_receive_buffer(void)
{
    return rxCount;
}

void    usi_twi_set_request_callback(usi_on_request_ptr_t cb){
    request_cb = cb;
}

void    usi_twi_set_receive_callback(usi_on_receive_ptr_t cb) {
    receive_cb = cb;
}

/********************************************************************************

                            USI Start Condition ISR

********************************************************************************/

ISR( USI_START_VECTOR )
{
  uint8_t usi_pins;
  // http://www.atmel.com/webdoc/AVRLibcReferenceManual/group__avr__interrupts.html

  // Notes about ISR. The compiler in the Arduino IDE handles some of the
  // basic ISR plumbing (unless the "ISR_NAKED" attribute is applied).
  //   * The AVR processor resets the SREG.I bit when jumping into an ISR
  //   * The compiler automatically adds code to save SREG
  //   * < user's ISR code goes here >
  //   * The compiler automatically adds code to restore SREG
  //   * The compiler automatically uses the RETI instruction to return from the ISR.
  //     The RETI instruction enables interrupts after the return from ISR.
  // The compiler behavior can be altered with attributes into the ISR declaration;
  // however, the description above is the default.

  // cli() call is not necessary. Processor disables interrupts when
  // jumping to an ISR

  // no need to save the SREG. The compiler does this automatically when using the
  // ISR construct without modifying attributes.

  if ( !in_transaction )
  {
    // remeber the sleep enable bit when entering the ISR
    sleep_enable_bit = MCUCR & ( 1 << SE );

    // clear the sleep enable bit to prevent the CPU from entering sleep mode while executing this ISR.
    MCUCR &= ~( 1 << SE );
  }

  // set default starting conditions for new TWI package
  overflowState = USI_SLAVE_CHECK_ADDRESS;

  // set SDA as input
  DDR_USI &= ~( 1 << PORT_USI_SDA );

  // the start condition is that the master pulls SDA low.

  // wait for SCL to go low to ensure the Start Condition has completed (the
  // start detector will hold SCL low ) - if a Stop Condition arises then leave
  // the interrupt to prevent waiting forever - don't use USISR to test for Stop
  // Condition as in Application Note AVR312 because the Stop Condition Flag is
  // going to be set from the last TWI sequence

  // while SCL is high and SDA is low
  while  ( ( usi_pins = PIN_USI & USI_PINS_SCL_SDA ) == USI_PINS_SCL );

  // if SDA line was low at SCL edge, then start condition occurred
  if ( !( usi_pins & USI_PINS_SDA ) )
  {
    // a Stop Condition did not occur
    
    // Execute callback if this is a repeated start
    if (in_transaction)
    {
        USI_RECEIVE_CALLBACK();
    }

    USICR =
         // keep Start Condition Interrupt enabled to detect RESTART
         ( 1 << USISIE ) |
         // enable Overflow Interrupt
         ( 1 << USIOIE ) |
         // set USI in Two-wire mode, hold SCL low on USI Counter overflow
         ( 1 << USIWM1 ) | ( 1 << USIWM0 ) |
         // Shift Register Clock Source = External, positive edge
         // 4-Bit Counter Source = external, both edges
         ( 1 << USICS1 ) | ( 0 << USICS0 ) | ( 0 << USICLK ) |
         // no toggle clock-port pin
         ( 0 << USITC );
         
    //remember that the USI is in a valid i2c transaction
    in_transaction = 1;

  }
  else
  {
    // a Stop Condition did occur

    USICR =
         // enable Start Condition Interrupt
         ( 1 << USISIE ) |
         // disable Overflow Interrupt
         ( 0 << USIOIE ) |
         // set USI in Two-wire mode, no USI Counter overflow hold
         ( 1 << USIWM1 ) | ( 0 << USIWM0 ) |
         // Shift Register Clock Source = external, positive edge
         // 4-Bit Counter Source = external, both edges
         ( 1 << USICS1 ) | ( 0 << USICS0 ) | ( 0 << USICLK ) |
         // no toggle clock-port pin
         ( 0 << USITC );

    //no longer in valid i2c transaction
    in_transaction = 0;
    // restore the sleep enable bit
    MCUCR |= sleep_enable_bit;

  } // end if

  USISR =
       // clear interrupt flags - resetting the Start Condition Flag will
       // release SCL
       ( 1 << USI_START_COND_INT ) | ( 1 << USIOIF ) |
       ( 1 << USIPF ) |( 1 << USIDC ) |
       // set USI to sample 8 bits (count 16 external SCL pin toggles)
       ( 0x0 << USICNT0);

  // no need to restore the SREG. The compiler does this automatically when using the
  // ISR construct without modifying attributes.

  // The compiler automatically uses an RETI instruction to return when using the
  // ISR construct without modifying attributes.

} // end ISR( USI_START_VECTOR )



/********************************************************************************

                                USI Overflow ISR

Handles all the communication.

Only disabled when waiting for a new Start Condition.

********************************************************************************/

ISR( USI_OVERFLOW_VECTOR )
{
  uint8_t finished;
  uint8_t usi_pins;

  // http://www.atmel.com/webdoc/AVRLibcReferenceManual/group__avr__interrupts.html

  // Notes about ISR. The compiler in the Arduino IDE handles some of the
  // basic ISR plumbing.
  //   * The AVR processor resets the SREG.I bit when jumping into an ISR
  //   * The compiler automatically adds code to save the SREG
  //   * < user's ISR code goes here >
  //   * The compiler automatically adds code to restore the SREG
  //   * The compiler automatically uses the RETI instruction to return from the ISR.
  //     The RETI insturction enables interrupts after the return from ISR.
  // The compiler behavior can be altered with attributes into the ISR declaration;
  // however, the description above is the default.

  // cli() call is not necessary. Processor disables interrupts when
  // jumping to an ISR

  // no need to save the SREG. The compiler does this automatically when using the
  // ISR construct without modifying attributes.

  // The ISR is only ever entered because the ISR(USI_START_VECTOR) interrupt
  // routine ran first. That routine saved the sleep mode and disabled sleep.

  // Most of the time this routine exits, it has setup the USI to shift in/out bits
  // and is expected to re-entered because of the USI overflow interrupt. Track whether or
  // not the transaction is completely finished.
  finished = 0;


  switch ( overflowState )
  {

    // Address mode: check address and send ACK (and next USI_SLAVE_SEND_DATA) if OK,
    // else reset USI
    case USI_SLAVE_CHECK_ADDRESS:
      if ( ( USIDR == 0 ) || ( ( USIDR >> 1 ) == slaveAddress) )
      {
        if ( USIDR & 0x01 )
        {
          overflowState = USI_SLAVE_SEND_DATA;
        }
        else
        {
          overflowState = USI_SLAVE_REQUEST_DATA;
        } // end if

