DavidMarquezF/mf-embedded/apps/attiny85/semaphore/usi_twi_slave.c
        // ack the start frame
        // sets up the USI to pull SDA low and clock one bit (two edges)
        SET_USI_TO_SEND_ACK( );
      }
      else
      {
        SET_USI_TO_TWI_START_CONDITION_MODE( );
        finished = 1;
      }
      break;

    // master-read / slave-send: check reply and goto USI_SLAVE_SEND_DATA if OK,
    // else reset USI
    case USI_SLAVE_CHECK_REPLY_FROM_SEND_DATA:
      // Execute request callback for each byte requested, as this is the intended
      // behavior of this library
      USI_REQUEST_CALLBACK();
      if ( USIDR )
      {
        // if NACK, the master does not want more data
        SET_USI_TO_TWI_START_CONDITION_MODE( );
        finished = 1;
        break;
      }
      // from here we just drop straight into USI_SLAVE_SEND_DATA if the
      // master sent an ACK

    // copy data from buffer to USIDR and set USI to shift byte
    // next USI_SLAVE_REQUEST_REPLY_FROM_SEND_DATA
    case USI_SLAVE_SEND_DATA:
      // Get data from Buffer
      if ( txCount )
      {
        USIDR = txBuf[ txTail ];
        txTail = ( txTail + 1 ) & TWI_TX_BUFFER_MASK;
        txCount--;

        overflowState = USI_SLAVE_REQUEST_REPLY_FROM_SEND_DATA;
        SET_USI_TO_SEND_DATA( );
      }
      else
      {
        // the buffer is empty
        SET_USI_TO_READ_ACK( ); // This might be neccessary sometimes see http://www.avrfreaks.net/index.php?name=PNphpBB2&file=viewtopic&p=805227#805227
        SET_USI_TO_TWI_START_CONDITION_MODE( );
      } // end if
      break;

    // set USI to sample reply from master
    // next USI_SLAVE_CHECK_REPLY_FROM_SEND_DATA
    case USI_SLAVE_REQUEST_REPLY_FROM_SEND_DATA:
      overflowState = USI_SLAVE_CHECK_REPLY_FROM_SEND_DATA;
      SET_USI_TO_READ_ACK( );
      break;

    // master-send / slave-receive: set USI to sample data from master, next
    // USI_SLAVE_GET_DATA_AND_SEND_ACK
    case USI_SLAVE_REQUEST_DATA:
      overflowState = USI_SLAVE_GET_DATA_AND_SEND_ACK;
      SET_USI_TO_READ_DATA( );

      // with the SET_USI_TO_READ_DATA() macro call above, the USI has
      // been setup to catch the next byte if the master sends one.
      // while that's going on, look for a stop condition here which
      // is when the SDA line goes high after the SCL line;

      // wait until SCL goes high
      while  ( ! ( ( usi_pins = PIN_USI & USI_PINS_SCL_SDA ) & USI_PINS_SCL ) );

      // if SDA line was high at SCL edge, then not a stop condition
      if ( usi_pins & USI_PINS_SDA )
        break;

      // wait until SCL goes low or SDA goes high
      while  ( ( usi_pins = PIN_USI & USI_PINS_SCL_SDA ) == USI_PINS_SCL );

      // if both SCL and SDA are high, then stop condition occurred
      if ( usi_pins == USI_PINS_SCL_SDA )
      {
        USI_RECEIVE_CALLBACK();
        SET_USI_TO_TWI_START_CONDITION_MODE( );
        finished = 1;
      }

      break;

    // copy data from USIDR and send ACK
    // next USI_SLAVE_REQUEST_DATA
    case USI_SLAVE_GET_DATA_AND_SEND_ACK:
      // put data into buffer
      // check buffer size
      if ( rxCount < TWI_RX_BUFFER_SIZE )
      {
        rxBuf[ rxHead ] = USIDR;
        rxHead = ( rxHead + 1 ) & TWI_RX_BUFFER_MASK;
        rxCount++;
      } else {
        // overrun
        // drop data
      }
      // next USI_SLAVE_REQUEST_DATA
      overflowState = USI_SLAVE_REQUEST_DATA;
      SET_USI_TO_SEND_ACK( );
      break;

  } // end switch

  if (finished)
  {
    //no longer in valid i2c transaction
    in_transaction = 0;
    // restore the sleep enable bit
    // note that this allows sleep -- it does not cause sleep
    MCUCR |= sleep_enable_bit;
  }

  // no need to restore the SREG. The compiler does this automatically when using the
  // ISR construct without modifying attributes.

  // The compiler automatically uses an RETI instruction to return when using the
  // ISR construct without modifying attributes.

} // end ISR( USI_OVERFLOW_VECTOR )
